package test;

import java.util.Scanner;

public class test05 {
    /*
  2019年1月1日起，国家推出新的个人所得税政策，起征点上调值5000元。也就是说税前工资扣除三险一金（三险一金数额假设是税前工资的10%）
  后如果不足5000元，则不交税。如果大于5000元，那么大于5000元的部分按梯度交税，具体梯度比例如下：

	0 ~ 3000元的部分，交税3%

	3000 ~ 12000元的部分，交税10%

	12000 ~ 25000的部分 ， 交税20%

	25000 ~ 35000的部分，交税25%

	35000 ~ 55000的部分，交税30%

	55000 ~ 80000的部分，交税35%

	超过80000的部分，交税45%

比如：
黑马某学员入职一家企业后，税前工资是15000，则他每月该交个税的部分是15000-1500-5000=8500元，
个税缴纳数额是3000×3%+5500×10%=640元。税后工资12860元。

请完成一个个税计算程序，在用户输入税前工资后，计算出他对应的纳税数额，以及税后工资为多少？
     */

    public static void main(String[] args) {

        //输入税前工资
        Scanner sc = new Scanner(System.in);
        System.out.println("输入税前工资");
        int income = sc.nextInt();
        double chuwu = income-income*0.1;
        double part = chuwu -5000;
        double tax=0.0;
        if(chuwu<5000.0){
            System.out.println("不需要缴税");
        }
        //计算纳税数额
        //梯度比例使用if 计算

        else if (part>0&&part<=3000 ){
            tax = part*0.03;
            }
        //3000 ~ 12000元的部分，交税10%
        else if (part>3000&& part<=12000){
            tax=3000*0.03+(part-3000)*0.1;

        }
        //12000 ~ 25000的部分 ， 交税20%
        else if(part>12000&&part<=25000){
            tax = 3000*0.03+9000*0.1+(part-12000)*0.2;

        }
        //25000 ~ 35000的部分，交税25%
        else if (part>25000&&part<=35000){
            tax=3000*0.03+9000*0.1+13000*0.2+(part-25000)*0.25;
        }
        //35000 ~ 55000的部分，交税30%
        else if (part>35000&&part<=55000){
            tax=3000*0.03+9000*0.1+13000*0.2+(35000-25000)*0.25+(part-35000)*0.3;
        }
        //55000 ~ 80000的部分，交税35%
        else if (part>55000&&part<=800000){

            tax=3000*0.03+9000*0.1+13000*0.2+(35000-25000)*0.25+(55000-35000)*0.3+(part-55000)*0.35;
        }
        //超过80000的部分，交税45%
        else if (part>80000){
            tax=3000*0.03+9000*0.1+13000*0.2+(35000-25000)*0.25+(55000-35000)*0.3+(800000-55000)*0.35+(part-800000)*0.45;
        }


        //计算税后工资

        System.out.println("纳税数额"+tax);
        System.out.println("税后工资为"+(chuwu-tax));



    }
}
